Show / Hide Table of Contents
Class CoordSystem
Coordinate system base class
Inheritance
System.Object
OpenObject
CoordSystem
CoordSystemByPoint
CoordSystemByVector
CoordSystemByZup
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class CoordSystem : OpenObject
 Improve this Doc
 View Source